"Every 10 minutes" = "Var 10:e minut";
"Manually" = "Manuellt";
"Rescan" = "Skanna";
"Show Info" = "Visa info";
"Delete selected source" = "Radera markerade källor";
"Every day" = "Varje dag";
"Add source..." = "Lägg till källa...";
"Every half hour" = "Varje halvtimme";
"Rescan source" = "Skanna källa";
"Sources" = "Källor";
"Every hour" = "Varje timme";
"Rescan frequency" = "Skanningsfrekvens";
